app/controllers/yoga_classes_controller.rb

SELECT "yoga_classes".* FROM "yoga_classes"
---
  def index
    @yoga_classes = YogaClass.all

INSERT INTO "yoga_classes" ("size", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["size", 1212], ["date", "2016-02-04"], ["time", "2016-02-04 17:18:00.000000"], ["created_at", "2016-02-04 17:24:45.019197"], ["updated_at", "2016-02-04 17:24:45.019197"]]
---
  def create
    @yoga_class = YogaClass.new(yoga_class_params)

    if @yoga_class.save

SELECT  "yoga_classes".* FROM "yoga_classes" WHERE "yoga_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @yoga_class = YogaClass.find(params[:id])